#!/usr/bin/env python
# -*- coding: utf-8 -*-
import sys
import codecs
import io # 追加

#sys.stdout = codecs.getwriter('utf_8')(sys.stdout)
#sys.stdout = io.TextIOWrapper(sys.stdout.buffer, encoding='utf-8') # 追加

positionDec = {}


stamenList = 	[
			[u'2014/3/28',u'9岡島',u'4藤田',u'5銀次',u'Dジョーンズ',u'3ユーキリス',u'7枡田',u'6松井稼',u'2嶋',u'8聖澤',u'P則本',u'L岸'],
			[u'2014/3/29',u'9岡島',u'4藤田',u'5銀次',u'Dジョーンズ',u'3ユーキリス',u'7後藤',u'6松井稼',u'2嶋',u'8牧田',u'P塩見',u'L菊池'],
			[u'2014/3/30',u'9岡島',u'4藤田',u'5銀次',u'Dジョーンズ',u'3ユーキリス',u'7枡田',u'6松井稼',u'2嶋',u'8聖澤',u'P辛島',u'Lレイノルズ'],
			[u'2014/4/1',u'9岡島',u'4藤田',u'5銀次',u'Dジョーンズ',u'3ユーキリス',u'7枡田',u'6松井稼',u'2嶋',u'8聖澤',u'P美馬',u'Bs西'],
			[u'2014/4/2',u'9岡島',u'4藤田',u'5銀次',u'Dジョーンズ',u'3ユーキリス',u'7後藤',u'6西田',u'2嶋',u'8聖澤',u'P松井裕',u'Bs岸田'],
			[u'2014/4/3',u'9岡島',u'4藤田',u'5銀次',u'Dジョーンズ',u'3ユーキリス',u'7牧田',u'6松井稼',u'2嶋',u'8聖澤',u'P森',u'Bs井川'],
			[u'2014/4/4',u'9岡島',u'4藤田',u'5銀次',u'Dジョーンズ',u'3ユーキリス',u'7後藤',u'6松井稼',u'2小関',u'8聖澤',u'P則本',u'H攝津'],
			[u'2014/4/5',u'9岡島',u'4藤田',u'5銀次',u'3ジョーンズ',u'Dユーキリス',u'7後藤',u'6西田',u'2小関',u'8聖澤',u'P塩見',u'H中田'],
			[u'2014/4/6',u'9岡島',u'4藤田',u'5銀次',u'Dジョーンズ',u'3ユーキリス',u'6後藤',u'7枡田',u'2小関',u'8聖澤',u'P辛島',u'Hウルフ'],
			[u'2014/4/8',u'9岡島',u'4藤田',u'5銀次',u'Dジョーンズ',u'3ユーキリス',u'7後藤',u'6松井稼',u'2嶋',u'8聖澤',u'P美馬',u'Fメンドーサ'],
			[u'2014/4/9',u'9岡島',u'4藤田',u'5銀次',u'Dジョーンズ',u'3ユーキリス',u'7後藤',u'6松井稼',u'2嶋',u'8聖澤',u'P松井裕',u'F上沢'],
			[u'2014/4/10',u'9岡島',u'4藤田',u'3銀次',u'Dジョーンズ',u'7枡田',u'5後藤',u'6松井稼',u'2嶋',u'8聖澤',u'P森',u'F斎藤佑'],
			[u'2014/4/11',u'9岡島',u'4藤田',u'5銀次',u'Dジョーンズ',u'3ユーキリス',u'6松井稼',u'7枡田',u'2嶋',u'8牧田',u'P則本',u'M成瀬'],
			[u'2014/4/12',u'9岡島',u'4藤田',u'5銀次',u'Dジョーンズ',u'3ユーキリス',u'6後藤',u'7枡田',u'2嶋',u'8聖澤',u'P塩見',u'M唐川'],
			[u'2014/4/13',u'9岡島',u'4藤田',u'5銀次',u'Dジョーンズ',u'3ユーキリス',u'6松井稼',u'7枡田',u'2小関',u'8聖澤',u'P辛島',u'M石川'],
			[u'2014/4/15',u'9岡島',u'4藤田',u'3銀次',u'Dジョーンズ',u'5後藤',u'6松井稼',u'7枡田',u'2嶋',u'8聖澤',u'P美馬',u'Hスタンリッジ'],
			[u'2014/4/16',u'9岡島',u'4藤田',u'5銀次',u'3ジョーンズ',u'7後藤',u'6松井稼',u'D嶋',u'2小関',u'8聖澤',u'P松井裕',u'H寺原'],
			[u'2014/4/18',u'9岡島',u'4藤田',u'5銀次',u'3ジョーンズ',u'6松井稼',u'7牧田',u'D枡田',u'2嶋',u'8聖澤',u'P則本',u'F吉川'],
			[u'2014/4/19',u'9岡島',u'4藤田',u'5銀次',u'Dジョーンズ',u'3ユーキリス',u'6松井稼',u'7牧田',u'2嶋',u'8聖澤',u'P塩見',u'F武田勝'],
			[u'2014/4/20',u'9岡島',u'4藤田',u'5銀次',u'Dジョーンズ',u'3ユーキリス',u'6松井稼',u'7枡田',u'2小関',u'8牧田',u'P辛島',u'F大谷'],
			[u'2014/4/22',u'9岡島',u'4藤田',u'5銀次',u'Dジョーンズ',u'3ユーキリス',u'6松井稼',u'7枡田',u'2嶋',u'8榎本',u'P美馬',u'L牧田'],
			[u'2014/4/23',u'9岡島',u'4藤田',u'5銀次',u'Dジョーンズ',u'3ユーキリス',u'6松井稼',u'7枡田',u'2嶋',u'8牧田',u'P松井裕',u'L野上'],
			[u'2014/4/24',u'9岡島',u'4藤田',u'5銀次',u'Dジョーンズ',u'3ユーキリス',u'6松井稼',u'7枡田',u'2嶋',u'8牧田',u'P森',u'L岡本洋'],
			[u'2014/4/25',u'9岡島',u'4藤田',u'5銀次',u'Dジョーンズ',u'3ユーキリス',u'6松井稼',u'7枡田',u'2嶋',u'8牧田',u'P則本',u'Bs金子千尋'],
			[u'2014/4/26',u'9岡島',u'4藤田',u'5銀次',u'Dジョーンズ',u'3ユーキリス',u'6松井稼',u'8牧田',u'2嶋',u'7枡田',u'P塩見',u'Bsディクソン'],
			[u'2014/4/27',u'9岡島',u'4藤田',u'3銀次',u'Dジョーンズ',u'7枡田',u'6松井稼',u'8牧田',u'2小関',u'5後藤',u'P辛島',u'Bs吉田一'],
			[u'2014/4/29',u'9岡島',u'4藤田',u'3銀次',u'Dジョーンズ',u'7枡田',u'6松井稼',u'5後藤',u'2嶋',u'8牧田',u'P美馬',u'M涌井'],
			[u'2014/4/30',u'9岡島',u'5西田',u'4藤田',u'Dジョーンズ',u'3銀次',u'6松井稼',u'2嶋',u'8牧田',u'7島内',u'P上園',u'M古谷'],
			[u'2014/5/1',u'9岡島',u'4藤田',u'6松井稼',u'Dジョーンズ',u'3銀次',u'7枡田',u'5西田',u'2嶋',u'8島内',u'P森',u'M唐川'],
			[u'2014/5/2',u'9岡島',u'4藤田',u'7枡田',u'Dジョーンズ',u'5銀次',u'3小斉',u'6西田',u'2嶋',u'8島内',u'P則本',u'H攝津'],
			[u'2014/5/3',u'8島内',u'4藤田',u'9岡島',u'Dジョーンズ',u'5銀次',u'7枡田',u'3小斉',u'2伊志嶺',u'6西田',u'P塩見',u'H中田'],
			[u'2014/5/4',u'9岡島',u'4藤田',u'3小斉',u'Dジョーンズ',u'5銀次',u'7枡田',u'6西田',u'2嶋',u'8森山',u'P辛島',u'Hウルフ'],
			[u'2014/5/5',u'9岡島',u'4藤田',u'5銀次',u'Dジョーンズ',u'7枡田',u'3小斉',u'6松井稼',u'2嶋',u'8島内',u'P川井',u'L牧田'],
			[u'2014/5/6',u'9岡島',u'4藤田',u'5銀次',u'Dジョーンズ',u'7枡田',u'3小斉',u'6松井稼',u'2嶋',u'8島内',u'P上園',u'L野上'],
			[u'2014/5/9',u'9岡島',u'4藤田',u'5銀次',u'Dジョーンズ',u'3ボウカー',u'7中島',u'6松井稼',u'2嶋',u'8牧田',u'P則本',u'M成瀬'],
			[u'2014/5/10',u'6西田',u'4藤田',u'5松井稼',u'Dジョーンズ',u'9ボウカー',u'7中島',u'3銀次',u'2伊志嶺',u'8牧田',u'P塩見',u'M藤岡'],
			[u'2014/5/11',u'8島内',u'4藤田',u'5松井稼',u'Dジョーンズ',u'7ボウカー',u'3銀次',u'9牧田',u'2嶋',u'6西田',u'P辛島',u'M石川'],
			[u'2014/5/13',u'8島内',u'4藤田',u'5松井稼',u'Dジョーンズ',u'7ボウカー',u'3銀次',u'9岡島',u'2嶋',u'6西田',u'P川井',u'Bs西'],
			[u'2014/5/14',u'6西田',u'4藤田',u'5松井稼',u'Dジョーンズ',u'7ボウカー',u'8牧田',u'3銀次',u'2嶋',u'9岡島',u'P森',u'Bs井川'],
			[u'2014/5/17',u'9岡島',u'4藤田',u'3銀次',u'Dジョーンズ',u'7ボウカー',u'5松井稼',u'6西田',u'2嶋',u'8島内',u'P辛島',u'L岸'],
			[u'2014/5/18',u'9岡島',u'4藤田',u'3銀次',u'Dジョーンズ',u'7ボウカー',u'5松井稼',u'8牧田',u'2伊志嶺',u'6西田',u'P塩見',u'L十亀'],
			[u'2014/5/20',u'9岡島',u'4藤田',u'5銀次',u'3ジョーンズ',u'7ボウカー',u'6松井稼',u'2嶋',u'8聖澤',u'1川井','',u'DB久保'],
			[u'2014/5/22',u'9岡島',u'4藤田',u'2嶋',u'3ジョーンズ',u'5松井稼',u'7牧田',u'6西田',u'8聖澤',u'1則本','',u'DB尚成'],
			[u'2014/5/23',u'9岡島',u'4藤田',u'8聖澤',u'3ジョーンズ',u'7ボウカー',u'5松井稼',u'6西田',u'2嶋',u'1辛島','',u'Dカブレラ'],
			[u'2014/5/24',u'9岡島',u'4藤田',u'2嶋',u'3ジョーンズ',u'7牧田',u'5松井稼',u'6西田',u'8聖澤',u'1美馬','',u'D雄太'],
			[u'2014/5/25',u'9岡島',u'4藤田',u'6西田',u'Dジョーンズ',u'7牧田',u'5松井稼',u'3岩崎',u'2小関',u'8聖澤',u'Pブラックリー',u'S八木'],
			[u'2014/5/26',u'9岡島',u'4藤田',u'6西田',u'Dジョーンズ',u'7枡田',u'3ボウカー',u'5松井稼',u'2嶋',u'8聖澤',u'P川井',u'S古野'],
			[u'2014/5/28',u'8聖澤',u'4藤田',u'9岡島',u'Dジョーンズ',u'2嶋',u'5松井稼',u'3ボウカー',u'7牧田',u'6西田',u'P則本',u'G大竹'],
			[u'2014/5/29',u'8聖澤',u'4藤田',u'9岡島',u'Dジョーンズ',u'2嶋',u'5松井稼',u'3ボウカー',u'7牧田',u'6西田',u'P辛島',u'G内海'],
			[u'2014/5/31',u'4藤田',u'8聖澤',u'9岡島',u'3ジョーンズ',u'7ボウカー',u'2嶋',u'5松井稼',u'6西田',u'1美馬','',u'C大瀬良'],
			[u'2014/6/1',u'4藤田',u'8聖澤',u'9岡島',u'3ジョーンズ',u'7ボウカー',u'6西田',u'5後藤',u'2小関',u'1ブラックリー','',u'Cバリントン'],
			[u'2014/6/3',u'4藤田',u'8聖澤',u'9岡島',u'3ジョーンズ',u'7牧田',u'5松井稼',u'2嶋',u'6西田',u'1則本','',u'Tメッセンジャー'],
			[u'2014/6/4',u'4藤田',u'6西田',u'9岡島',u'3ジョーンズ',u'5松井稼',u'7牧田',u'8聖澤',u'2嶋',u'1川井','',u'T藤浪'],
			[u'2014/6/6',u'4藤田',u'3嶋',u'9岡島',u'Dジョーンズ',u'7牧田',u'5松井稼',u'8聖澤',u'2小関',u'6西田',u'P辛島',u'D雄太'],
			[u'2014/6/7',u'9岡島',u'4藤田',u'3後藤',u'Dジョーンズ',u'5松井稼',u'2嶋',u'7ボウカー',u'6西田',u'8聖澤',u'P美馬',u'D山井'],
			[u'2014/6/8',u'9岡島',u'4藤田',u'3後藤',u'Dジョーンズ',u'5松井稼',u'2嶋',u'7ボウカー',u'6西田',u'8森山',u'Pブラックリー',u'DB山口'],
			[u'2014/6/9',u'9岡島',u'4藤田',u'3後藤',u'Dジョーンズ',u'5松井稼',u'2嶋',u'7ボウカー',u'6西田',u'8森山',u'P則本',u'DB久保'],
			[u'2014/6/11',u'9岡島',u'4藤田',u'7牧田',u'3ジョーンズ',u'2嶋',u'5松井稼',u'6西田',u'8聖澤',u'1川井','',u'S石川'],
			[u'2014/6/13',u'9岡島',u'4藤田',u'6後藤',u'3ジョーンズ',u'5松井稼',u'2嶋',u'7ボウカー',u'8聖澤',u'1辛島','',u'S木谷'],
			[u'2014/6/14',u'9岡島',u'4藤田',u'6後藤',u'3ジョーンズ',u'5松井稼',u'2嶋',u'7ボウカー',u'8聖澤',u'1美馬','',u'G菅野'],
			[u'2014/6/15',u'9岡島',u'4藤田',u'6後藤',u'3ジョーンズ',u'5松井稼',u'2嶋',u'7ボウカー',u'8森山',u'1則本','',u'G小山'],
			[u'2014/6/18',u'9岡島',u'4藤田',u'2嶋',u'Dジョーンズ',u'7ボウカー',u'6後藤',u'5松井稼',u'3小斉',u'8森山',u'P川井',u'C野村'],
			[u'2014/6/19',u'9岡島',u'4藤田',u'2嶋',u'Dジョーンズ',u'7ボウカー',u'3銀次',u'5松井稼',u'6後藤',u'8森山',u'P松井裕',u'C前田'],
			[u'2014/6/21',u'9岡島',u'4藤田',u'3銀次',u'Dジョーンズ',u'5ラッツ',u'7ボウカー',u'6後藤',u'2嶋',u'8森山',u'P則本',u'Tメッセンジャー'],
			[u'2014/6/22',u'9岡島',u'4藤田',u'3銀次',u'Dジョーンズ',u'5ラッツ',u'7ボウカー',u'8牧田',u'2嶋',u'6西田',u'P美馬',u'T能見'],
			[u'2014/6/27',u'9岡島',u'4藤田',u'3銀次',u'Dジョーンズ',u'5ラッツ',u'7ボウカー',u'6松井稼',u'2嶋',u'8聖澤',u'P辛島',u'Fメンドーサ'],
			[u'2014/6/28',u'9岡島',u'4藤田',u'3銀次',u'Dジョーンズ',u'5後藤',u'7ボウカー',u'6松井稼',u'2嶋',u'8聖澤',u'P青山',u'F中村'],
			[u'2014/6/29',u'9岡島',u'4藤田',u'3銀次',u'Dジョーンズ',u'5ラッツ',u'7ボウカー',u'6後藤',u'2嶋',u'8森山',u'P則本',u'F浦野'],
			[u'2014/7/1',u'9岡島',u'4藤田',u'3銀次',u'Dジョーンズ',u'7ボウカー',u'6松井稼',u'5後藤',u'2嶋',u'8聖澤',u'P美馬',u'Bs西'],
			[u'2014/7/2',u'4藤田',u'2嶋',u'5銀次',u'3ジョーンズ',u'Dラッツ',u'7ボウカー',u'9岡島',u'6西田',u'8森山',u'P宮川',u'Bs東明'],
			[u'2014/7/3',u'5松井稼',u'8森山',u'3銀次',u'9ジョーンズ',u'Dラッツ',u'7ボウカー',u'2嶋',u'6西田',u'4藤田',u'P辛島',u'Bs金子千尋'],
			[u'2014/7/4',u'5松井稼',u'4藤田',u'3銀次',u'Dジョーンズ',u'7ボウカー',u'2嶋',u'9岡島',u'6西田',u'8聖澤',u'P青山',u'H攝津'],
			[u'2014/7/5',u'5松井稼',u'2嶋',u'3銀次',u'Dジョーンズ',u'7ボウカー',u'9岡島',u'4藤田',u'6西田',u'8聖澤',u'P則本',u'H中田'],
			[u'2014/7/6',u'5松井稼',u'6西田',u'3銀次',u'Dジョーンズ',u'7ボウカー',u'9岡島',u'4後藤',u'2小関',u'8森山',u'P美馬',u'H東浜'],
			[u'2014/7/8',u'5松井稼',u'9岡島',u'3銀次',u'Dジョーンズ',u'7牧田',u'2嶋',u'4藤田',u'6西田',u'8聖澤',u'P宮川',u'F武田勝'],
			[u'2014/7/9',u'5松井稼',u'4藤田',u'3銀次',u'Dジョーンズ',u'7ボウカー',u'9岡島',u'6西田',u'2小関',u'8牧田',u'P辛島',u'F大谷'],
			[u'2014/7/10',u'6松井稼',u'4藤田',u'3銀次',u'Dジョーンズ',u'5ラッツ',u'7ボウカー',u'9岡島',u'2嶋',u'8牧田',u'P青山',u'F上沢'],
			[u'2014/7/11',u'6松井稼',u'4藤田',u'3銀次',u'Dジョーンズ',u'5ラッツ',u'7牧田',u'9岡島',u'2嶋',u'8聖澤',u'P則本',u'M成瀬'],
			[u'2014/7/12',u'6西田',u'4藤田',u'3銀次',u'Dジョーンズ',u'5ラッツ',u'7牧田',u'9岡島',u'2小関',u'8聖澤',u'P美馬',u'M藤岡'],
			[u'2014/7/13',u'6西田',u'4藤田',u'Dジョーンズ',u'5ラッツ',u'3銀次',u'7ボウカー',u'9岡島',u'2嶋',u'8牧田',u'P宮川',u'M涌井'],
			[u'2014/7/14',u'6西田',u'4藤田',u'Dジョーンズ',u'5ラッツ',u'3銀次',u'7ボウカー',u'9岡島',u'2嶋',u'8聖澤',u'P塩見',u'Bs東明'],
			[u'2014/7/15',u'6西田',u'4藤田',u'Dジョーンズ',u'5ラッツ',u'3銀次',u'7ボウカー',u'9岡島',u'2小関',u'8聖澤',u'P辛島',u'Bs西'],
			[u'2014/7/16',u'6松井稼',u'4藤田',u'Dジョーンズ',u'5ラッツ',u'3銀次',u'7ボウカー',u'9岡島',u'2嶋',u'8森山',u'P則本',u'Bs金子千尋'],
			[u'2014/7/21',u'6松井稼',u'4藤田',u'Dジョーンズ',u'5ラッツ',u'3銀次',u'7ボウカー',u'9岡島',u'2嶋',u'8聖澤',u'P美馬',u'L牧田'],
			[u'2014/7/22',u'5松井稼',u'4藤田',u'Dジョーンズ',u'7ボウカー',u'3銀次',u'8牧田',u'6西田',u'2嶋',u'9岡島',u'P青山',u'L菊池'],
			[u'2014/7/23',u'6西田',u'4藤田',u'3銀次',u'5松井稼',u'Dボウカー',u'7牧田',u'9岡島',u'8聖澤',u'2小関',u'P松井裕',u'L岡本洋'],
			[u'2014/7/25',u'5松井稼',u'4藤田',u'9岡島',u'Dジョーンズ',u'3銀次',u'7ボウカー',u'6西田',u'2嶋',u'8聖澤',u'P塩見',u'F浦野'],
			[u'2014/7/26',u'5松井稼',u'4藤田',u'9岡島',u'Dジョーンズ',u'3銀次',u'7ボウカー',u'6西田',u'2小関',u'8聖澤',u'P辛島',u'F大谷'],
			[u'2014/7/27',u'5松井稼',u'4藤田',u'9岡島',u'Dジョーンズ',u'3銀次',u'7ボウカー',u'6西田',u'2嶋',u'8聖澤',u'P則本',u'Fメンドーサ'],
			[u'2014/7/29',u'5松井稼',u'4藤田',u'9岡島',u'Dジョーンズ',u'3銀次',u'7ボウカー',u'2嶋',u'6西田',u'8聖澤',u'P青山',u'Hスタンリッジ'],
			[u'2014/7/30',u'5松井稼',u'4藤田',u'9岡島',u'Dジョーンズ',u'3銀次',u'7牧田',u'6西田',u'2小関',u'8聖澤',u'P松井裕',u'H飯田'],
			[u'2014/7/31',u'5松井稼',u'4藤田',u'9岡島',u'Dジョーンズ',u'3銀次',u'7ボウカー',u'2嶋',u'6西田',u'8島内',u'P塩見',u'H東浜'],
			[u'2014/8/1',u'5松井稼',u'4藤田',u'9岡島',u'Dジョーンズ',u'3銀次',u'7ボウカー',u'8聖澤',u'2小関',u'6西田',u'P辛島',u'L藤原'],
			[u'2014/8/2',u'5松井稼',u'4藤田',u'9岡島',u'Dジョーンズ',u'3銀次',u'7ボウカー',u'8聖澤',u'2小関',u'6西田',u'P則本',u'Lレイノルズ'],
			[u'2014/8/3',u'5松井稼',u'4藤田',u'9岡島',u'Dジョーンズ',u'3銀次',u'7ボウカー',u'2嶋',u'8聖澤',u'6西田',u'P川井',u'L岸'],
			[u'2014/8/5',u'9岡島',u'4藤田',u'5銀次',u'Dジョーンズ',u'7ボウカー',u'3エバンス',u'2嶋',u'6西田',u'8聖澤',u'P青山',u'M石川'],
			[u'2014/8/6',u'6松井稼',u'9岡島',u'5銀次',u'Dジョーンズ',u'3エバンス',u'8牧田',u'7ボウカー',u'4西田',u'2小関',u'P松井裕',u'M古谷'],
			[u'2014/8/7',u'9岡島',u'4藤田',u'5銀次',u'Dジョーンズ',u'7ボウカー',u'3エバンス',u'8島内',u'6西田',u'2小関',u'P塩見',u'M唐川'],
			[u'2014/8/12',u'8島内',u'4藤田',u'9岡島',u'Dジョーンズ',u'5銀次',u'7ボウカー',u'3エバンス',u'2嶋',u'6岩崎',u'P辛島',u'Hスタンリッジ'],
			[u'2014/8/13',u'6松井稼',u'4藤田',u'9岡島',u'Dジョーンズ',u'5銀次',u'3エバンス',u'7牧田',u'2小関',u'8島内',u'P松井裕',u'H飯田'],
			[u'2014/8/14',u'6松井稼',u'4藤田',u'9岡島',u'Dジョーンズ',u'5銀次',u'3ボウカー',u'7牧田',u'2小関',u'8島内',u'P塩見',u'H岩嵜'],
			[u'2014/8/15',u'D松井稼',u'4藤田',u'9岡島',u'3ジョーンズ',u'5銀次',u'7牧田',u'6西田',u'2小関',u'8島内',u'P則本',u'M藤岡'],
			[u'2014/8/16',u'D松井稼',u'4藤田',u'9岡島',u'3ジョーンズ',u'5銀次',u'7ボウカー',u'6西田',u'2小関',u'8島内',u'P宮川',u'M涌井'],
			[u'2014/8/17',u'D松井稼',u'4藤田',u'9岡島',u'3ジョーンズ',u'5銀次',u'7牧田',u'6西田',u'2嶋',u'8島内',u'P菊池',u'M成瀬'],
			[u'2014/8/20',u'D松井稼',u'4藤田',u'9岡島',u'3ジョーンズ',u'5銀次',u'7枡田',u'6西田',u'2小関',u'8島内',u'P松井裕',u'F中村'],
			[u'2014/8/21',u'7松井稼',u'4藤田',u'9岡島',u'Dジョーンズ',u'5銀次',u'3枡田',u'6西田',u'2嶋',u'8島内',u'P辛島',u'F浦野'],
			[u'2014/8/22',u'7松井稼',u'4藤田',u'9岡島',u'Dジョーンズ',u'5銀次',u'3枡田',u'6西田',u'2嶋',u'8島内',u'P塩見',u'Bs金子千尋'],
			[u'2014/8/23',u'D松井稼',u'4藤田',u'9岡島',u'3ジョーンズ',u'5銀次',u'7枡田',u'8島内',u'6西田',u'2小関',u'P則本',u'Bs西'],
			[u'2014/8/24',u'7松井稼',u'4藤田',u'9岡島',u'Dジョーンズ',u'5銀次',u'3枡田',u'8島内',u'6西田',u'2小関',u'P菊池',u'Bs吉田一'],
			[u'2014/8/26',u'7松井稼',u'4藤田',u'9岡島',u'Dジョーンズ',u'5銀次',u'3枡田',u'8島内',u'2嶋',u'6阿部',u'P松井裕',u'L牧田'],
			[u'2014/8/28',u'7松井稼',u'4藤田',u'9岡島',u'Dジョーンズ',u'5銀次',u'3枡田',u'8島内',u'6西田',u'2小関',u'P塩見',u'L岡本洋'],
			[u'2014/8/29',u'D松井稼',u'4藤田',u'9岡島',u'3ジョーンズ',u'5銀次',u'8牧田',u'7枡田',u'6西田',u'2小関',u'P則本',u'H飯田'],
			[u'2014/8/30',u'7松井稼',u'4藤田',u'9岡島',u'Dジョーンズ',u'5銀次',u'3枡田',u'8島内',u'2嶋',u'6西田',u'P菊池',u'H中田'],
			[u'2014/8/31',u'D松井稼',u'4藤田',u'9岡島',u'3ジョーンズ',u'5銀次',u'7枡田',u'6西田',u'2嶋',u'8島内',u'P辛島',u'H大隣'],
			[u'2014/9/2',u'D松井稼',u'4藤田',u'9岡島',u'3ジョーンズ',u'5銀次',u'7枡田',u'8島内',u'2嶋',u'6西田',u'P松井裕',u'F中村'],
			[u'2014/9/3',u'D松井稼',u'4藤田',u'9岡島',u'3ジョーンズ',u'5銀次',u'7枡田',u'6西田',u'2嶋',u'8島内',u'P塩見',u'F大谷'],
			[u'2014/9/5',u'7松井稼',u'4藤田',u'9岡島',u'Dジョーンズ',u'5銀次',u'3枡田',u'6西田',u'2嶋',u'8島内',u'P則本',u'M大嶺祐'],
			[u'2014/9/6',u'7松井稼',u'4藤田',u'9岡島',u'Dジョーンズ',u'5銀次',u'2嶋',u'3枡田',u'6西田',u'8島内',u'P菊池',u'M成瀬'],
			[u'2014/9/7',u'7松井稼',u'4藤田',u'9岡島',u'Dジョーンズ',u'5銀次',u'2嶋',u'3枡田',u'6西田',u'8島内',u'P辛島',u'M木村'],
			[u'2014/9/8',u'D松井稼',u'4藤田',u'9岡島',u'3ジョーンズ',u'5銀次',u'7枡田',u'6西田',u'2嶋',u'8島内',u'P松井裕',u'Bs近藤'],
			[u'2014/9/9',u'D松井稼',u'4岩崎',u'9岡島',u'3ジョーンズ',u'5銀次',u'7枡田',u'6西田',u'2嶋',u'8島内',u'P塩見',u'Bs松葉'],
			[u'2014/9/10',u'D松井稼',u'4藤田',u'9岡島',u'6西田',u'3銀次',u'7枡田',u'5後藤',u'2嶋',u'8島内',u'P横山',u'Bs金子千尋'],
			[u'2014/9/13',u'7松井稼',u'4藤田',u'9岡島',u'Dジョーンズ',u'5銀次',u'3枡田',u'6西田',u'2嶋',u'8島内',u'P則本',u'L誠'],
			[u'2014/9/14',u'7松井稼',u'4藤田',u'9岡島',u'Dジョーンズ',u'5銀次',u'3枡田',u'6西田',u'2嶋',u'8島内',u'P菊池',u'L野上'],
			[u'2014/9/15',u'D松井稼',u'4藤田',u'9岡島',u'3ジョーンズ',u'5銀次',u'7枡田',u'6西田',u'2嶋',u'8島内',u'P辛島',u'L岸'],
			[u'2014/9/16',u'8島内',u'6西田',u'9岡島',u'Dジョーンズ',u'5銀次',u'7枡田',u'2嶋',u'3小斉',u'4阿部',u'P松井裕',u'M石川'],
			[u'2014/9/17',u'8島内',u'6西田',u'9岡島',u'Dジョーンズ',u'5銀次',u'7枡田',u'2嶋',u'3小斉',u'4阿部',u'P塩見',u'M大嶺祐'],
			[u'2014/9/18',u'8島内',u'4藤田',u'9岡島',u'Dジョーンズ',u'3銀次',u'7松井稼',u'2嶋',u'5内田',u'6西田',u'P横山',u'M木村'],
			[u'2014/9/19',u'8島内',u'4藤田',u'9岡島',u'Dジョーンズ',u'5銀次',u'3枡田',u'7松井稼',u'2嶋',u'6西田',u'P則本',u'Fメンドーサ'],
			[u'2014/9/20',u'8島内',u'4藤田',u'9岡島',u'Dジョーンズ',u'5銀次',u'3枡田',u'7松井稼',u'2嶋',u'6西田',u'P菊池',u'F吉川'],
			[u'2014/9/21',u'8島内',u'4藤田',u'9岡島',u'Dジョーンズ',u'5銀次',u'3枡田',u'7松井稼',u'2嶋',u'6西田',u'P辛島',u'F大谷'],
			[u'2014/9/23',u'8島内',u'4藤田',u'9岡島',u'Dジョーンズ',u'2嶋',u'3枡田',u'7松井稼',u'5岩崎',u'6西田',u'P松井裕',u'H大隣'],
			[u'2014/9/24',u'8島内',u'4藤田',u'9岡島',u'Dジョーンズ',u'2嶋',u'3枡田',u'7松井稼',u'5岩崎',u'6西田',u'P塩見',u'H攝津'],
			[u'2014/9/25',u'8島内',u'4藤田',u'9岡島',u'3ジョーンズ',u'2嶋',u'7枡田',u'D松井稼',u'5岩崎',u'6西田',u'P則本',u'H武田'],
			[u'2014/9/26',u'8島内',u'4藤田',u'9岡島',u'3ジョーンズ',u'2嶋',u'7枡田',u'D松井稼',u'5岩崎',u'6西田',u'P菊池',u'H中田'],
			[u'2014/9/27',u'8島内',u'4藤田',u'9岡島',u'Dジョーンズ',u'2嶋',u'3枡田',u'7松井稼',u'5岩崎',u'6西田',u'P横山',u'L岡本洋'],
			[u'2014/9/28',u'7松井稼',u'4藤田',u'9岡島',u'Dジョーンズ',u'3枡田',u'6西田',u'8島内',u'5岩崎',u'2小関',u'P濱矢',u'L誠'],
			[u'2014/9/29',u'7松井稼',u'4阿部',u'9岡島',u'Dジョーンズ',u'5銀次',u'3枡田',u'6西田',u'2嶋',u'8島内',u'P松井裕',u'Bs西'],
			[u'2014/9/30',u'7松井稼',u'4阿部',u'9岡島',u'Dジョーンズ',u'5銀次',u'3枡田',u'6西田',u'2嶋',u'8島内',u'P塩見',u'Bs金子千尋'],
			[u'2014/10/1',u'D松井稼',u'4岩崎',u'9岡島',u'3ジョーンズ',u'7枡田',u'2嶋',u'6西田',u'5三好',u'8島内',u'P則本',u'F吉川'],
			[u'2014/10/3',u'D松井稼',u'4藤田',u'9岡島',u'3枡田',u'5銀次',u'2嶋',u'8島内',u'6西田',u'7榎本',u'P菊池',u'L岡本洋'],
			[u'2014/10/4',u'3銀次',u'6西田',u'D松井稼',u'7枡田',u'9岡島',u'2嶋',u'8島内',u'5内田',u'4三好',u'P辛島',u'Bs松葉'],
			[u'2014/10/5',u'3銀次',u'7榎本',u'9岡島',u'D枡田',u'8島内',u'6西田',u'5内田',u'4藤田',u'2嶋',u'P松井裕',u'F大谷'],
			[u'2014/10/7',u'7松井稼',u'4藤田',u'9岡島',u'6西田',u'5銀次',u'D中島',u'3枡田',u'2小関',u'8島内',u'P則本',u'Bs中山']
		]

#生データ処理
for list in stamenList:
	for i in range(1,9):
		p = list[i]
		
		if p == '':
			continue
		
		position =  p[0]
		if position == 'P':
			position = u'1'
		
		name = p[1:]
		
		positionList =  positionDec.get(name, '')
		if positionList == '':
			positionList = [position]
		else:
			positionList.append(position)
		positionDec[name] = positionList

#ポジションのチェンジ回数を数えてみる
for name, positionList in positionDec.items():	
	changed = 0
	prePosition = ''
	changeHistoryDect = {}
	for position in positionList:
		if prePosition != '' and prePosition != position:
			changed += 1
			changeHisotry = prePosition + "->" + position
			changeHisotryCount =  changeHistoryDect.get(changeHisotry, 0)
			changeHistoryDect[changeHisotry] = changeHisotryCount + 1
		
		prePosition = position
		
	if changed > 0:
		print (name + "," + str(changed))
		print (changeHistoryDect)
